{
  "intents": [
      {
          "tag": "greeting",
          "patterns": ["Hello", "Hi", "Hey", "How are you?", "What's up?"],
          "responses": ["Hello! How can I assist you today?", "Hi there! How can I help?", "Hey! What can I do for you?"]
      },
      {
          "tag": "goodbye",
          "patterns": ["Goodbye", "Bye", "See you later", "Adios"],
          "responses": ["Goodbye! If you have more questions, feel free to ask.", "Bye! Have a great day!", "See you later!"]
      },
      {
          "tag": "thanks",
          "patterns": ["Thank you","Thankyou", "Thanks", "Appreciate it"],
          "responses": ["You're welcome!", "No problem! If you need anything else, just ask.", "You're welcome! Let me know if you have more questions."]
      },
      {
          "tag": "questions",
          "patterns": ["Can I ask a question?", "I have a question", "Ask a question"],
          "responses": ["Of course! Please go ahead and ask your question, and I'll do my best to help you."]
      },
      {
          "tag": "resume_creation",
          "patterns": ["How do I create a resume?", "Can you guide me on making a resume?", "Resume building help"],
          "responses": ["To create a resume, you can visit our Resume Building page. It will guide you through the process step by step."]
      },
      {
          "tag": "course_recommendation",
          "patterns": ["Which Udemy courses are best for my career?", "Can you recommend me some courses on Udemy?", "What courses should I take?"],
          "responses": ["We can recommend Udemy courses tailored to your career goals. Please provide more details about your desired career, and we'll suggest courses accordingly."]
      },
      {
          "tag": "job_recommendation",
          "patterns": ["Can you recommend jobs for me?", "I'm looking for a job", "Job recommendations"],
          "responses": ["Of course! To recommend jobs, please tell me about your skills and career interests, and I'll find suitable job listings for you."]
      },
      {
          "tag": "people_recommendation",
          "patterns": ["Can you recommend people to connect with on LinkedIn?", "Who should I connect with on LinkedIn?", "LinkedIn connections"],
          "responses": ["Certainly! To provide personalized LinkedIn connection recommendations, please share more details about your industry, career goals, and interests, and I'll suggest some relevant connections for you."]
      },
      {
          "tag": "career_guidance",
          "patterns": ["How can I improve my skills for my dream job?", "I want my dream job", "What's the roadmap to my dream career?", "Guide me to my dream job"],
          "responses": ["We can provide you with a personalized roadmap to your dream career. Please tell us more about your career goals and current skills."]
      },
      {
          "tag": "progress_tracking",
          "patterns": ["How can I track my progress?", "Can you update my progress?", "Progress report"],
          "responses": ["We can help you track your progress towards your career goals. Let us know what you've achieved since our last conversation, and we'll update your profile accordingly."]
      },
      {
          "tag": "fallback",
          "patterns": ["Sorry, I don't understand.", "I'm not sure.", "What do you mean?"],
          "responses": ["I apologize, but I couldn't comprehend that. Could you please rephrase or ask another question?", "I'm not quite sure what you mean. Can you clarify or ask a different question?"]
      }
  ]
}
